# 1 Тип задания.
## 1 Иттерация
```
n = int(input()) #вводится любая переменная в строку
r = bin(n) #переводит переменную в двоичную систему 
print(r) #выводит результат на экран
```
### Для примера вводим число 50, вот, что выведет код:
* `Число: 50`
* `0b110010`
## 2 Иттерация
### Нам нужно избавиться от лишних симовлов в результате, что мы для этого добавляем в код:
```
n = int(input()) #Здесь ничего пока не меняем
r = bin(n)[2:] #Здесь добавляем двойку в квадратные скобки чтобы избавится от 0b
print(r) #выводит результат на экран
if n % 2 == 0: #если переменная в n будет четным при делен на 2 то:
    r += '01' #к перменной r в конце добавляем 01
else: #иначе если пременная n нечетное то:
    r +='10' #к перменной r в конце добавляем 10
print(r) #выводит итоговый ответ после кода
```
### После того как мы внесли изменения, теперь ответ будет выводить:
* `Число: 50`
* `110010`
* `11001001`
## 3 Иттерация
### Здесь после написания for нужно вывести весь код вперед, это можно сделать выделев все после range и нажать TAB один раз.
```
for n in range(1, 100): #для все чисел в диапозоне от 1 до 100 выполняется следующие команды
    r = bin(n)[2:] #переводит все числа в диапозоне в двоичную систему
    if n % 2 == 0:
        r += '01'
    else:
        r +='10'
    print(n, r) #выводит все числа диапозона от 1 до 100 и переводит их также в двоичную систему
```
### Но этого нам недостаточно, нам нужно чтобы Python выводил двоичную систему в десятичную, поэтому мы добавим в print(n, r) оператор int к r чтобы Python мог сразу выдать ответ в десятичной системе.
## 4 Иттерация 
```
for n in range(1, 100): 
    r = bin(n)[2:] 
    if n % 2 == 0:
        r += '01'
    else:
        r +='10'
    print(n, int(r)) #выводит все числа диапозона от 1 до 100 но уже переводит в десятичную систему 
```
### Просто так все не будет и простого написания int будет недостаточно, это связано с тем что Python считает десятичную систему как простое число, а нам нужно чтобы Python понимал что число которо он считает числом, понимал как двоичную систему считсления, поэтому мы в int(r) добавим цифру 2, так Python будет понимать  результат не как простое число а как двоичную систему.
## 5 Иттерация
```
for n in range(1, 100): 
    r = bin(n)[2:] 
    if n % 2 == 0:
        r += '01'
    else:
        r +='10'
    print(n, int(r, 2)) #Теперь когда будет выводиться результат, он будет также выводитьсч в двоичной системе.
```
### Теперь когда код практически готов, нам нужно отсечь те числа которые меньше 130 и оставить те числа которые выполняют условия задачи.
## 6 Иттерация.
```
for n in range(1, 100): 
    r = bin(n)[2:] 
    if n % 2 == 0:
        r += '01'
    else:
        r +='10'
    if int(r, 2) > 130 #Если число большее 130 то:
        print(int(r, 2)) # Число выводиться на экран
```
### Итговый результат: Код выводит числа больше 130 и ввводит их в двоичной системе.
# 2 Тип задания.
На вход алгоритма подаётся натуральное число №. Алгоритм строит по нему новое число R следующим образом. 1) Строится двоичная запись числа N. 2) К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если нечётное. 3) К полученному результату дописывается ещё один бит четности. Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа №) является двоичной записью искомого числа В. Укажите минимальное число №, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе.
## Иттерация 1
```
n = int(input()) #вводится переменная в строку
r = bin(n)[2:] #переводит переменную в двоичную систему без лишних символов
print(r) #выводит число на экран
if r.count ('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
print(r)
if r.count('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
print(r) #выводит полученный результат после кода
```
Пример: вводим число:
* `50`
* Получаем:
* `110010`
* `1100101`
* `11001010`
## Иттерация 2
Нам по условию необходимо найти минимальное N которое будет большк 184 и результаты записать в десятичной системе. Для этого нам нужно дописать код, который будет выводит числа больше 184 в десятичной системе счисления.
```
for n in range(1, 100) #Для нахождения числа будет использоваться for для перебора чисел.
r = bin(n)[2:] #переводит переменную в двоичную систему без лишних символов
print(r) #выводит число на экран
if r.count ('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
print(r)
if r.count('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
if int(r, 2) > 184 #Если число в двоичной системе будет больше 184 то
    print(n) #Выводиться результат n
```
